erp3l/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <comment>(-УХПредставлениеСписка)(-УХПредставлениеОбъекта)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектЭтапа</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОсновнаяВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалютаПлатежей</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьБазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделИнвестиционнойПрограммы</name>
    <type>
      <types>CatalogRef.РазделыИнвестиционныхПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправление</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыПредшественники</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/Проекты/Forms/ФормаВыбораДляИнвестРаздела/Module.bsl
&НаКлиенте
Процедура ИзменитьРазделИнвестПрограммыПроекта(Проект, Раздел=Неопределено)
	
	мПроекты = ПроектыДляОтмены.НайтиСтроки(Новый Структура("Проект", Проект));
	Если мПроекты.Количество() = 0 Тогда
		// регистрируем первоначальный раздел, для возможной отмены
		НоваяСтрока = ПроектыДляОтмены.Добавить();
		НоваяСтрока.Проект = Проект;
	Иначе
		НоваяСтрока = Неопределено;
	КонецЕсли;
	
	СтарыйРаздел = ИзменитьРазделИнвестПрограммыПроектаНаСервере(Проект, Раздел);
	
	Если НоваяСтрока <> Неопределено Тогда
		НоваяСтрока.ИсходныйРаздел = СтарыйРаздел;
	КонецЕсли;
	
	Элементы.ПроектыДляВыбора.Обновить();
	Элементы.ВыбранныеПроекты.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьРазделИнвестПрограммыПроектаНаСервере(Проект, РазделИнвестПрограммы)
	
	СтарыйРаздел = Проект.РазделИнвестиционнойПрограммы;
	
	ПроектОбъект = Проект.ПолучитьОбъект();
	ПроектОбъект.РазделИнвестиционнойПрограммы = РазделИнвестПрограммы;
	ПроектОбъект.Записать();
	
	Возврат СтарыйРаздел;
КонецФункции

&НаКлиенте
Процедура ПринятьИзменения(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтменитьИЗакрытьНаСервере()
	Для Каждого Строка_ Из ПроектыДляОтмены Цикл
		ИзменитьРазделИнвестПрограммыПроектаНаСервере(Строка_.Проект, Строка_.ИсходныйРаздел)
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)
	ОтменитьИЗакрытьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РазделИнвестиционнойПрограммы = Параметры.РазделИнвестПрограммы;
	Если НЕ ЗначениеЗаполнено(РазделИнвестиционнойПрограммы) Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(ВыбранныеПроекты, "РазделИнвестиционнойПрограммы", РазделИнвестиционнойПрограммы, Истина);
	ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(ПроектыДляВыбора, "РазделИнвестиционнойПрограммы", Справочники.РазделыИнвестиционныхПрограмм.ПустаяСсылка(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПроектыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ИзменитьРазделИнвестПрограммыПроекта(ПараметрыПеретаскивания.Значение[0], РазделИнвестиционнойПрограммы);
КонецПроцедуры

&НаКлиенте
Процедура ПроектыДляВыбораПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ИзменитьРазделИнвестПрограммыПроекта(ПараметрыПеретаскивания.Значение[0], Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПроектыДляВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ПроектыДляВыбора.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьРазделИнвестПрограммыПроекта(ТекДанные.Ссылка, РазделИнвестиционнойПрограммы);
КонецПроцедуры
